# HR Analytics Project

This project analyzes the HR Analytics Employee Attrition dataset.  
We use both **SQL** and **Python (Pandas)** to answer key business questions,  
then visualize insights for the HR department.

In [ ]:
import sqlite3
import pandas as pd
#import Libaries

In [ ]:
df = pd.read_csv('WA_Fn-UseC_-HR-Employee-Attrition.csv') # Read the file

In [ ]:
conn = sqlite3.connect("employees.db")
df.to_sql("employees", conn, if_exists="replace", index=False) #storing data

# SQL Queries questions

##### Q1: How many total employees are there?

In [ ]:
q1 = pd.read_sql_query("SELECT COUNT (*) FROM employees ;",conn)
q1

   COUNT (*)
0       2729

##### Q2: What is the employee count for each department?

In [ ]:
q2 = pd.read_sql_query("SELECT Department, COUNT(Department) FROM employees GROUP BY Department;",conn)
q2

               Department  COUNT(Department)
0         Human Resources               1055
1  Research & Development                961
2                   Sales                446

##### Q3: What is the average monthly income by job role?

In [ ]:
q3 = pd.read_sql_query("SELECT round(AVG(MonthlyIncome),2), jobrole FROM employees GROUP BY Jobrole ;",conn)
q3

   round(AVG(MonthlyIncome),2)                    JobRole
0                      7528.76  Healthcare Representative
1                      4235.75            Human Resources
2                      3237.17      Laboratory Technician
3                     17181.68                    Manager
4                      7295.14     Manufacturing Director
5                     16033.55          Research Director
6                      3239.97         Research Scientist
7                      6924.28            Sales Executive
8                      2626.00       Sales Representative

##### Q4: Who are the top 5 employees by performance rating?

In [ ]:
q4 = pd.read_sql_query("SELECT employeeNumber,Jobrole,Department,MonthlyIncome, performanceRating from employees ORDER BY performanceRating DESC LIMIT 5 ;",conn)
q4

,EmployeeNumber,JobRole,Department,MonthlyIncome,PerformanceRating
0,2,Research Scientist,Research & Development,5130,4
1,10,Laboratory Technician,Research & Development,2670,4
2,11,Laboratory Technician,Research & Development,2693,4
3,12,Manufacturing Director,Research & Development,9526,4
4,27,Sales Representative,Sales,3407,4

##### Q5: Which department has the highest average performance rating?

In [ ]:
q5 = pd.read_sql_query("SELECT Department , round(AVG(PerformanceRating),2) from employees Group by Department order by AVG(performanceRating) DESC LIMIT 1 ;",conn)
q5

               Department  round(AVG(PerformanceRating),2)
0  Research & Development                             3.16

#### Addtional Query in SQL

##### Q6: What is the employee count by Gender in every Department?

In [ ]:
q6 = pd.read_sql_query("SELECT Department , Gender , COUNT(*) as Total from employees group by gender ,department order by department, gender;",conn)
q6

               Department  Gender  Total
0         Human Resources  Female     20
1         Human Resources    Male     43
2  Research & Development  Female    379
3  Research & Development    Male    582
4                   Sales  Female    189
5                   Sales    Male    257

##### Q7: What is the average Job Satisfaction by Job Role?

In [ ]:
q7 = pd.read_sql_query("SELECT  JobRole, round( AVG(JobSatisfaction),2) AS avg_job_satisfaction,  COUNT(*) AS totalEmployees  FROM employees GROUP BY JobRole  ORDER BY avg_job_satisfaction ASC; ",conn)
q7

                     JobRole  avg_job_satisfaction  totalEmployees
0            Human Resources                  2.56              52
1     Manufacturing Director                  2.68             145
2      Laboratory Technician                  2.69             259
3          Research Director                  2.70              80
4                    Manager                  2.71             102
5       Sales Representative                  2.73              83
6            Sales Executive                  2.75             326
7         Research Scientist                  2.77             292
8  Healthcare Representative                  2.79             131

##### Q8: What is the average Monthly Income by Job Level?

In [ ]:
q8 = pd.read_sql_query("SELECT Joblevel , round(avg(MonthlyIncome),2) from employees group by joblevel order by avg(MonthlyIncome) DESC ;",conn)
q8

   JobLevel  round(avg(MonthlyIncome),2)
0         5                     19191.83
1         4                     15503.78
2         3                      9817.25
3         2                      5502.28
4         1                      2786.92

# Python Query Questions

##### Q1: How many total employees are there?

In [ ]:
total_employees = len(df)
print("Q1) Total employees:", total_employees)

Q1) Total employees: 1470

##### Q2: What is the employee count for each department?

In [ ]:
dept_counts = df["Department"].value_counts()
print("Q2) Employee count per department:", dept_counts)

Q2) Employee count per department: Department
Research & Development    961
Sales                     446
Human Resources            63
Name: count, dtype: int64

##### Q3: What is the average monthly income by job role?

In [ ]:
avg_income_by_role = df.groupby("JobRole")["MonthlyIncome"].mean().round(2)
print("Q3) Average monthly income by job role:",avg_income_by_role)

Q3) Average monthly income by job role: JobRole
Healthcare Representative     7528.76
Human Resources               4235.75
Laboratory Technician         3237.17
Manager                      17181.68
Manufacturing Director        7295.14
Research Director            16033.55
Research Scientist            3239.97
Sales Executive               6924.28
Sales Representative          2626.00
Name: MonthlyIncome, dtype: float64